tutorials/flatRoof3D/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include            "include/ABLConditions"
    
    inlet
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    "(sides|top)"
    {
        type            zeroGradient;
    }

    bottom
    {
        type            atmNutUWallFunction;
        kappa           $kappa;
        Cmu             $Cmu;
        z0              $z0;
        value           uniform 0.0;
    }

    "(cube|roof.snow)"
    {
        type            nutkWallFunction;
        value           uniform 0; 
    }
}


// ************************************************************************* //
