tutorials/flatRoof3D/0.orig/pointDisplacement.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(bottom|top)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    roof.snow
    {
        type            codedFixedValue;
        value           uniform (0 0 0);

        name            MESH_UDF;
    }

    cube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(sides|inlet|outlet)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
