tutorials/flatRoof3D/constant/erosionDepositionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


ca              7e-4;
rhoSnow         150;
rhoAir          1;
Uthreshold      0.2;

UResidual       (2e-4 5e-4 5e-4);
pResidual       5e-4; 
TResidual       5e-6;
nSubCycles      1000;